1. buat sebuah DataFrame dari bangkitan data random integer minimal 50 data yang akan membentuk dataframe 5 kolom 10 baris
2. tampilkan 2 kolom pada dataframe tsb
3. tampilkan 1 kolom terakhir dgn menggunakan no indexnya
4. tambahkan 1 kolom baru yg merupakan bangkitan data random normal
5. coba akses data yg berada pada pokok kanan bawah di dataframe

In [2]:
import numpy as np 
import pandas as pd

In [7]:
df = pd.DataFrame(np.random.randint(1,100,(10,5)), columns = ['A',"B",'C',"D","E"])
df

    A   B   C   D   E
0  43  33   6  82  64
1   3  96  37  99  25
2  65  38   5  28  63
3  45  95  99  45  74
4  47  55  73   5  89
5  86  26  56  71  23
6   9  70   7  99  19
7  61  87  72   7  25
8  98  72  24  52  35
9  13  56  59  23  25

In [8]:
df[["A","D"]]

    A   D
0  43  82
1   3  99
2  65  28
3  45  45
4  47   5
5  86  71
6   9  99
7  61   7
8  98  52
9  13  23

Tampilkan baris terakhir dgn kolom indexnya

In [9]:
df.loc[9]

A    13
B    56
C    59
D    23
E    25
Name: 9, dtype: int32

In [11]:
df.iloc[-1]

A    13
B    56
C    59
D    23
E    25
Name: 9, dtype: int32

Tampilkan kolom terakhir dgn kolom indexnya

In [10]:
df['E']

0    64
1    25
2    63
3    74
4    89
5    23
6    19
7    25
8    35
9    25
Name: E, dtype: int32

In [12]:
df.iloc[:,-1]

0    64
1    25
2    63
3    74
4    89
5    23
6    19
7    25
8    35
9    25
Name: E, dtype: int32

bangkitkan kolom baru

In [13]:
df['F']=np.random.randn(10)
df

    A   B   C   D   E         F
0  43  33   6  82  64  0.740066
1   3  96  37  99  25 -0.250341
2  65  38   5  28  63  1.277037
3  45  95  99  45  74 -1.381351
4  47  55  73   5  89 -0.325614
5  86  26  56  71  23  1.524549
6   9  70   7  99  19 -2.426198
7  61  87  72   7  25  0.059586
8  98  72  24  52  35 -1.276540
9  13  56  59  23  25  0.123010

tampilkan kolom & baris terakhir

In [14]:
df.iloc[9,5]

0.12301030470242935

In [15]:
df.iloc[-1,-1]

0.12301030470242935

In [16]:
df >0

      A     B     C     D     E      F
0  True  True  True  True  True   True
1  True  True  True  True  True  False
2  True  True  True  True  True   True
3  True  True  True  True  True  False
4  True  True  True  True  True  False
5  True  True  True  True  True   True
6  True  True  True  True  True  False
7  True  True  True  True  True   True
8  True  True  True  True  True  False
9  True  True  True  True  True   True

In [17]:
df[df>5]

      A   B     C     D   E   F
0  43.0  33   6.0  82.0  64 NaN
1   NaN  96  37.0  99.0  25 NaN
2  65.0  38   NaN  28.0  63 NaN
3  45.0  95  99.0  45.0  74 NaN
4  47.0  55  73.0   NaN  89 NaN
5  86.0  26  56.0  71.0  23 NaN
6   9.0  70   7.0  99.0  19 NaN
7  61.0  87  72.0   7.0  25 NaN
8  98.0  72  24.0  52.0  35 NaN
9  13.0  56  59.0  23.0  25 NaN

In [19]:
df[(df>0)&(df<50)]

      A     B     C     D     E         F
0  43.0  33.0   6.0   NaN   NaN  0.740066
1   3.0   NaN  37.0   NaN  25.0       NaN
2   NaN  38.0   5.0  28.0   NaN  1.277037
3  45.0   NaN   NaN  45.0   NaN       NaN
4  47.0   NaN   NaN   5.0   NaN       NaN
5   NaN  26.0   NaN   NaN  23.0  1.524549
6   9.0   NaN   7.0   NaN  19.0       NaN
7   NaN   NaN   NaN   7.0  25.0  0.059586
8   NaN   NaN  24.0   NaN  35.0       NaN
9  13.0   NaN   NaN  23.0  25.0  0.123010

In [20]:
df[(df>0)&(df<50)]['A']

0    43.0
1     3.0
2     NaN
3    45.0
4    47.0
5     NaN
6     9.0
7     NaN
8     NaN
9    13.0
Name: A, dtype: float64

In [21]:
df

    A   B   C   D   E         F
0  43  33   6  82  64  0.740066
1   3  96  37  99  25 -0.250341
2  65  38   5  28  63  1.277037
3  45  95  99  45  74 -1.381351
4  47  55  73   5  89 -0.325614
5  86  26  56  71  23  1.524549
6   9  70   7  99  19 -2.426198
7  61  87  72   7  25  0.059586
8  98  72  24  52  35 -1.276540
9  13  56  59  23  25  0.123010

In [30]:
df[(df['A']<10)|(df['B']>50)][["D","F"]]

    D         F
1  99 -0.250341
3  45 -1.381351
4   5 -0.325614
6  99 -2.426198
7   7  0.059586
8  52 -1.276540
9  23  0.123010

In [31]:
#sebutin nama kolomnya apa, CASE SENSITIVE
df.loc[:,"A"]

0    43
1     3
2    65
3    45
4    47
5    86
6     9
7    61
8    98
9    13
Name: A, dtype: int32

In [32]:
df.loc[[4,7],"D"]

4    5
7    7
Name: D, dtype: int32

In [33]:
#index no indexnya
df.iloc[1,3]

99